{"meta":{"title":"我的博客","subtitle":null,"description":null,"author":"高立飞","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"","slug":"微信开发","date":"2018-12-02T03:27:44.721Z","updated":"2018-11-30T09:51:55.241Z","comments":true,"path":"2018/12/02/微信开发/","link":"","permalink":"http://yoursite.com/2018/12/02/微信开发/","excerpt":"","text":"一、昨日回顾1. 知识回顾2. 昨日反馈二、知识路径 微信公众平台基本介绍 ​ 微信发展史 ​ 什么是微信公众平台 ​ 微信与微信公众平台的区别 ​ 微信公众平台相关说明 ​ 微信公众平台技术文档 注册公众平台（订阅号） ==目标：能够注册公众平台订阅号== 两种模式 ​ 编辑模式 ==目标：能够掌握使用编辑模式设置简单内容操作== ​ 开发者模式 ​ 微信公众平台测试平台使用==目标：能够完成注册natapp和相关配置；能够开启开发模式== 三、今日课程内容：微信开发011. 微信公众平台基本介绍微信发展史 2011年1月21日，腾讯推出微信应用程序。（张小龙） 2012年8月20日，腾讯推出微信公众平台功能，同年11月开放第三方接口 2013年11月注册用户量突破6亿，是亚洲地区最大用户群体的移动即时通讯软件。 截止到现在，微信已经覆盖中国 96% 以上的智能手机，尽管微信的月活用户已经达到10亿，其在中国市场依旧有着非常大的增长潜力。 什么是微信公众平台官网登录网址：https://mp.weixin.qq.com/ 微信公众平台是腾讯为了让用户申请和管理微信公众账号而推出的一个Web平台，而微信公众账号的操作管理在这个平台下进行。所有用户都在腾讯提供的统一微信公众平台下进行用来管理微信公众号相关操作。 微信与微信公众平台的区别微信：基于点对点关系 个人私人化使用 你发信息给你的同学, 1 对 1 关系 微信公众平台：是基于一对多关系 1 对 N； 公众平台可以给关注了它的用户进行资讯信息推送及其相关服务功能的提供，相当于一个24为您服务的服务人员。可用于品牌推广，个人展示等。 微信公众平台相关说明微信公众平台可以对4个部分进行控制，分别是订阅号、服务号、企业微信（企业号）和小程序。当前我们只针对非小程序部分进行说明。 小结：==个人注册使用只能是 【订阅号】==，如果企业的话，都是可以注册，但是根据业务不同来进行选择， 服务类：用服务号 企业内部：企业号 资讯或推广：用订阅号 微信公众平台技术文档地址：https://mp.weixin.qq.com/wiki 2. 注册公众平台（订阅号） 进入官网，点击立即注册： 然后选择订阅号： 填写相关信息，点击注册： 根据提示填写相关信息，进入如下界面时需要选择类型，我们当前是个人，所以选择订阅号，一定不要选错： 进入订阅号用户认证信息填写页面： 完善订阅号信息： 最终进入如下后台界面，说明订阅号注册成功。 3. 两种模式在微信公众平台存在两种运行模式：1）编辑模式；2）开发者模式； 编辑模式使用微信公众号提供的统一的微信公众管理平台，进行操作。所有功能都已经写好，直接使用即可。只需要编辑相关内容信息。==适合不会编程的人使用==。 如果使用了编辑模式，它就不能很好的与现有的公司的系统结合，所以一般来说，在企业中不适用。 被关注时自动回复 进入微信公众平台后台，设置如下： 关注订阅号， 点击后： 下载后，扫码关注即可， 关注后效果为： 输出了刚才设置的自动回复的内容。 自定义菜单自定义菜单注意事项： 底部菜单功能不区分公众号的类型，认不认证都是有相应的创建权限 认证后，才可以填写跳转到任意地址按钮 顶级菜单最多可以创建==3个==；标题最多的汉字是4个，英文8个 顶级下面的子级菜单最多可以创建==5个== 顶级下面有子级菜单，则对其顶级菜单的设置的属性将不生效 菜单创建生效是异步执行，==如果开发时想及时看到效果，则需要取关再关注== 进入相关公众平台后台界面进行设置， 开发者模式微信公众平台，可以在后台设置自动回复，但有时这个也满足不了我们的需求，可以开启开发模式，把公众号的消息回调到自己的服务器去处理。 微信公众平台提供了服务器接入的方式，具有开发能力的运营者，可以进行定制开发。 开发者模式：特别适合企业，所以我们说的微信公众号开发就是说开发者模式的学习与使用。 ==开发者模式需要一台外网能访问到的服务器== ==注意：==微信公众平台管理中，编辑模式和开发者模式是==互斥的==，也就是说只能使用其中一种。 开发者模式有2种请求方式： ==被动==： ==主动==： 准备工作实际的开发工作中，我们首先需要有一个外网服务器，比如 阿里云、腾讯云、百度云等；而对于我们当前学习测试阶段，我们可以换一种方案代替外网服务器：==内网穿透==。 内网穿透基本介绍natapp软件,它给我们提供一个外网的域名，通过此软件，把我们内网的IP和端口，映射到它自己的服务器上面，这样公众号服务器访问到他们的服务器上面，然后它在转发到我们的内网中，这样就实现了内网的穿透。 网址：https://natapp.cn/ 软件平台，需要注册，注册是免费不花钱的。可以免费使用，需要是成年人并且实名认证。 注册natapp 首先进入官网进行注册： 注册成功后进行需要进行实名认证： 点击后填写信息即可： 购买隧道 在后台界面点击：购买隧道–》免费隧道 填写信息，点击购买： 成功后查看： 列表中的==autotoken==是一个非常重要的信息，不要给别人，这就是我们进行内网穿透，的凭证，用此凭证，我们就可以知道其身份，所以不要乱给别人使用，会影响到自己的环境的使用。 本机配置 下载软件： 软件下载: https://natapp.cn/#download 将软件解压缩： 在解压后的文件夹中新建一个名为config.ini文件， 打开后构建如下配置内容： 在apache主配置文件httpd.conf中增加如下配置： 接着在apache的虚拟主机配置文件中增加如下配置： 重启apache， 测试访问项目文件： 在day1/code目录下创建一个info.php文件，内容如下： 然后在浏览器中访问： 访问成功！ 跟着进入natapp.exe所在目录，并且在当前目录下打开cmd黑窗口， 进入目录： 打开黑窗口： 在黑窗口中输入natapp后按回车： 输入： 回车后，出现如下界面；==注意：不要关闭下面的界面==： 使用远程地址替换本地地址进行测试访问： 访问成功，说明配置OK。 下载官方接入代码下载地址：http://t.cn/RkGPhCJ 下载后进行解压： 开启开发模式 首先进入后台 设置–》公众号设置 启用开发者密码（点击后将会要求填写相关认证信息）： 启用成功后界面效果为： 然后将官方接入程序文件拷贝一份到day1/code目录下，并且改名为wx.php 拷贝到day1/code下并改名： wx.php的内容： 继续在该界面点击修改配置，填写相关信息： 点击： 填写信息： 提交后再点击启用按钮启用开发者模式： 启用后界面效果为： 到此，开发模式就已经开启成功。 微信公众平台测试平台使用因为我们使用的订阅号和服务号没有认证，所以很多的接口没有提供给我们，这样在测试的阶段和开发的阶段就没有办法进行了，所以公众号考虑到开发者的此情况的存在，故提供了一个测试平台公众号，用此公众号来开发测试，可以有所有的权限，这样对我们的开发就没有障碍了。但是不包括支付接口。 测试平台登陆页面地址（需要扫码登陆）：https://mp.weixin.qq.com/debug/cgi-bin/sandbox?t=sandbox/login 测试平台接入登陆平台后，填写接口配置信息并提交： ==注意：==上图中URL地址需要和 公众平台后台开发者模式设置的地址一致；Token也需要保持一致。 提交后提示成功界面效果如下说明接入测试平台成功： 接收普通消息 将day1/code/wx.php中的代码进行调整，构建测试代码： 我们当前使用的是PHP7.x，故将类wechatCallbackapiTest中reponseMsg方法里一句过时的代码改为可用的代码： 扫码关注测试公众号： 发送消息，查看测试公众号返回给用户的消息： ==案例：==实现将接收到的普通消息录入到数据库中。 在mysql中创建db8.tb1数据表： 12345678create database db8;create table tb1(id int unsigned primary key auto_increment,openid varchar(100) not null default &apos;&apos; comment &apos;用户唯一标识openid&apos;,content varchar(255) not null default &apos;&apos; comment &apos;用户发送给平台的内容&apos;,post_date int unsigned not null default 0 comment &apos;用户发送时间&apos;)engine=MyISAM charset=utf8; 将day1/code/wx.php获得的信息通过PDO录入到数据库tb1表中： 测试用户发送消息后的效果： 查看数据表： 4. 全天总结 微信公众平台：1) 订阅号； 2）服务号；3）企业号； 能够注册微信公众平台订阅号； 微信公众平台的两种模式：1)编辑模式； 2）开发者模式； 实现开发者模式必要的条件：必须要有一台线上的服务器； 实现接入微信公众平台","categories":[],"tags":[],"keywords":[]},{"title":"Hello World","slug":"hello-world","date":"2018-12-01T13:21:22.584Z","updated":"2018-12-02T02:46:19.433Z","comments":true,"path":"2018/12/01/hello-world/","link":"","permalink":"http://yoursite.com/2018/12/01/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[],"keywords":[]}]}